# LumensPerWatt Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..LumensPerWatt Property
UnitTypeId Class See Also
---
Lumens per watt.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId LumensPerWatt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LumensPerWatt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LumensPerWatt {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace